//7.  Напишите функцию, которая берет объект любой вложенности 
//и преобразует ее в единую плоскую карту с разными уровнями, разделенными косой чертой ( '/').

function mapObject(obj, prefix = '') {
    let result = {};  // Створюємо об'єкт для зберігання результату

    for (var key in obj) {  // Перебираємо всі властивості об'єкта obj
        var value = obj[key];  // Отримуємо значення поточної властивості

        if (typeof value === 'object' && !Array.isArray(value)) {
            // Якщо значення є об'єктом і не є масивом, то рекурсивно викликаємо функцію mapObject
            // з оновленим префіксом, який включає ключ поточної властивості та '/' для відокремлення вкладених властивостей.
            const nestedMapping = mapObject(value, prefix + key + '/');
            
            // Об'єднуємо результати об'єднанням поточного об'єкта result і об'єкта nestedMapping.
            result = { ...result, ...nestedMapping };
        } else {
            // Якщо значення не є об'єктом або масивом, то додаємо його до об'єкта result з урахуванням префіксу.
            result[prefix + key] = value;
        }
    }
    
    return result;  // Повертаємо об'єкт з плоскою структурою.
}

const obj = {
    a: {
      b: {
        c: 12,
        d: 'Hello World'
      },
      e: [1,2,3]
    }
};

console.log(mapObject(obj));
// Виводить результат обробки об'єкта obj у вигляді плоскої структури з префіксами.
